InformationRegisters/МатериальноОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МатериальноОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗонаОтветственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиКадровогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиКадровогоУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРаботуНаНеполнуюСтавку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПереносОстатковОтпускаПриУвольненииПереводом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьУникальностьТабельныхНомеров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилоФормированияПредставленияЭлементовСправочникаСотрудники</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПравилФормированияПредставленияЭлементовСправочникаСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПечататьТ6ДляОтпусковПоБеременностиИРодам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьИзмененияОплатыТрудаВЛичнойКарточке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВПоляхВводаСотрудниковУчитыватьИзмененияФамилии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуетсяРаботаСКоронавирусом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучательСтимулирующихВыплатФСС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолучательСтимулирующихВыплатФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемНаРаботуБезПриказаОПриеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоциальныеВыплатыОтдельнымКатегориямМедРаботников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуютсяДанныеСотрудниковВнешнихИсточников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьМатериальнуюОтветственностьСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МатериальноОтветственныеЛица/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Замещение Тогда
		МатериальноОтветственныеЛица.МатериальноОтветственныеЛицаПередЗаписью(ЭтотОбъект, Отказ, Замещение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не ПолучитьФункциональнуюОпцию("УчитыватьМатериальнуюОтветственностьСотрудников") Тогда
		
		// Настройка "УчитыватьМатериальнуюОтветственностьСотрудников" взводится автоматически при записи в регистр.
		// И при записи интерактивно и при записи обменом.
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(*) КАК КоличествоЗаписей
			|ИЗ
			|	РегистрСведений.МатериальноОтветственныеЛица КАК МатериальноОтветственныеЛица
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(*) > 0";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			НастройкиКадровогоУчета = РегистрыСведений.НастройкиКадровогоУчета.СоздатьНаборЗаписей();
			НастройкиКадровогоУчета.Прочитать();
			Если НастройкиКадровогоУчета.Количество() > 0 Тогда
				НастройкиКадровогоУчета[0].УчитыватьМатериальнуюОтветственностьСотрудников = Истина;
				НастройкиКадровогоУчета.ДополнительныеСвойства.Вставить("ПроверятьБизнесЛогикуПриЗаписи");
			Иначе
				НоваяЗапись = НастройкиКадровогоУчета.Добавить();
				НоваяЗапись.УчитыватьМатериальнуюОтветственностьСотрудников = Истина;
			КонецЕсли;
			
			НастройкиКадровогоУчета.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
